# Section 1: Using the Titanic dataset:

### 1. Use the function defined in acquire.py to load the Titanic data.

In [4]:
import acquire as ac

In [11]:
titanic = ac.get_titanic_data()

### 2. Use the function defined in pepare.py to prepare the titanic data.

In [7]:
import prepare as pr

In [15]:
titanic = pr.prep_titanic_2(titanic)

### 3. Encode the categorical columns on train dataset. Create dummy variables of the categorical columns and concatenate them onto the dataframe. Remove the columns they are replacing. Repeat on validate and test.

In [16]:
import pandas as pd

In [20]:
dummies = pd.get_dummies(titanic[['embark_town', 'sex']], drop_first = True)
titanic = pd.concat([titanic, dummies], axis = 1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,embark_town_Queenstown,embark_town_Southampton,sex_male,embark_town_Queenstown,embark_town_Southampton,sex_male
0,0,3,male,22.0,1,0,7.2500,Southampton,0,0,1,1,0,1,1
1,1,1,female,38.0,1,0,71.2833,Cherbourg,0,0,0,0,0,0,0
2,1,3,female,26.0,0,0,7.9250,Southampton,1,0,1,0,0,1,0
3,1,1,female,35.0,1,0,53.1000,Southampton,0,0,1,0,0,1,0
4,0,3,male,35.0,0,0,8.0500,Southampton,1,0,1,1,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,Southampton,1,0,1,1,0,1,1
887,1,1,female,19.0,0,0,30.0000,Southampton,1,0,1,0,0,1,0
888,0,3,female,30.0,1,2,23.4500,Southampton,0,0,1,0,0,1,0
889,1,1,male,26.0,0,0,30.0000,Cherbourg,1,0,0,1,0,0,1
890,0,3,male,32.0,0,0,7.7500,Queenstown,1,1,0,1,1,0,1

### 4. Create a function named preprocess_titanic that accepts the train, validate, and test titanic data, and returns the dataframes ready for modeling.